Revit 2027 API
ParameterTypeId.ReferenceViewerUiTargetFilter Property
 "Filter": This is used by the UI to filter the list of target views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ReferenceViewerUiTargetFilter { get; }
Public Shared ReadOnly Property ReferenceViewerUiTargetFilter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ReferenceViewerUiTargetFilter {
	ForgeTypeId^ get ();
}
static member ReferenceViewerUiTargetFilter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace